export function GnomeLogo({ className = 'w-5 h-5' }: { className?: string }) {
  return (
    <svg
      className={className}
      viewBox="10 -4 28 48"
      xmlns="http://www.w3.org/2000/svg"
      style={{ overflow: 'visible' }}
      fill="none"
      stroke="currentColor"
      strokeLinecap="round"
    >
      {/* 腿 */}
      <path d="M21.35,30.17 Q20.8,34.84 19.67,40.03" strokeWidth="1.4" />
      <path d="M27.37,29.97 Q26.82,35.37 27.75,40.38" strokeWidth="1.4" />
      {/* 脚 */}
      <path d="M20.25,39.81 Q17.59,40 17.19,40.11 Q15.01,39.41 16.34,38.55" strokeWidth="1.2" />
      <path d="M28.09,39.53 Q28.8,38.69 30.69,40.28 Q31.59,38.08 31.67,39.34" strokeWidth="1.2" />
      {/* 身体 */}
      <path d="M17.99,30.31 Q16.96,26.85 16.54,23.55 Q18.17,22.29 18.75,20.15 Q20.63,18.41 24.24,18.36 Q26.52,18.11 28.78,19.79 Q28.72,22.48 31.18,24.19 Q31.78,25.76 30.44,29.93" strokeWidth="1.3" />
      {/* 腰带 */}
      <path d="M18.44,25.64 Q22.83,24.55 29.86,25.98" strokeWidth="1.1" />
      {/* 脸 */}
      <path d="M28.56,15 Q27.44,16.91 27.02,17.9 Q25.1,18.3 24,18.89 Q23.06,18.7 20.74,17.72 Q21.1,17.14 19.49,15 Q20.09,13.59 20.96,12 Q22.07,10.6 24,10.8 Q25.97,11.1 27.16,12.14 Q28.36,14.38 28.41,15Z" strokeWidth="1.2" />
      {/* 眼睛 */}
      <circle cx="22" cy="14.5" r="0.7" fill="currentColor" stroke="none" />
      <circle cx="26" cy="14.5" r="0.7" fill="currentColor" stroke="none" />
      {/* 胡子 */}
      <path d="M19.59,16.98 Q21.47,17.89 21.47,20.68 Q23.13,22.6 23.72,22.91" strokeWidth="1" />
      <path d="M27.66,17.15 Q27.01,18.12 27.13,21.39 Q24.98,22.88 23.89,22.63" strokeWidth="1" />
      <path d="M22.36,16.87 Q21.03,20.21 23.14,22.38" strokeWidth="0.8" />
      <path d="M26.41,16.71 Q25.81,19.47 24.68,21.55" strokeWidth="0.8" />
      {/* 帽子 */}
      <path d="M19.21,11.79 Q19.33,8.51 20.53,5.72 Q24.69,3.22 25.9,-0.34" strokeWidth="1.3" />
      <path d="M29.06,11.79 Q27.68,8.8 26.92,6.19 Q25.37,2.51 24.74,-0.17" strokeWidth="1.3" />
      {/* 帽檐 */}
      <path d="M19,12.11 Q21.64,12.77 23.74,12.83 Q25.9,11.96 29.17,11.72" strokeWidth="1.1" />
      {/* 手臂 */}
      <path d="M28.67,22.19 Q30.44,21.87 32.81,23.54 Q33.73,26.12 33.98,29.88" strokeWidth="1.1" />
      <path d="M34.31,29.94 Q34.64,35.24 33.65,38.37" strokeWidth="1.2" />
      {/* 手 */}
      <path d="M32.03,38.34 Q34.18,39.35 33.65,41.12 Q35.92,38.63 35.89,38.05" strokeWidth="1.1" />
    </svg>
  );
}
